[
  {
    "id": "project-sqlguesser",
    "title": "SQL Guesser",
    "blurb": "As part of the final project in CSCE 413, Software Security at Texas A&M, my team and I created a tool that can perform a blind SQLi using binary search to access information within a vulnerable MySQL DBMS.",
    "description": "<p>CSCE 413, Software Security, is a hands-on security class that covered the fundamentals of security related concepts for software development. Besides the many PoC's that we did, alongside studies of existing viruses, the final project was to find a zero-day exploit of an existing application or website.<br><br>Our team found many rudementary stored and reflected XSS vulnerabilities across many websites via Google Dorks, however, we only found a few websites vulnerable to SQLi. Of these websites, we found one that errored when a malformed query was input. Leveraging this, we created a tool called SQL Guesser. This tool had multiple modes for guessing database, table, and column names as well as row entries. The tool would 'guess' by querying if the nth character of some database element was higher or lower than a certain ASCII value (binary search). Since the vulnerable website did not have rate limiting or really any security checks, out team was able to map out their entire database.</p>",
    "date": "January 2025 - May 2025",
    "thumbnail": "project-sqlguesser/thumb-sqlguesser.png",
    "images": [
      "project-sqlguesser/sqlguesser-presentation.png",
      "project-sqlguesser/sqlguesser-report.png"
    ]
  },
  {
    "id": "project-securitypocs",
    "title": "Security PoCs",
    "blurb": "As part of CSCE 413, Software Security at Texas A&M, each student accomplished approximately 2-3 PoCs relating to various security concepts every week, including some short essays on popular viruses and vulnerabilities. These PoCs include, but are not limited to, OWASP top 10, dorking, SQLi and XSS, rudementary MITM, port knocking and network scanners, Android exploits, buffer overflows, Metasploit, password cracking, and popular tooling.",
    "description": "<p>As part of CSCE 413, Software Security at Texas A&M, each student accomplished approximately 2-3 PoCs relating to various security concepts every week, including some short essays on popular viruses and vulnerabilities. These PoCs include, but are not limited to, OWASP top 10, Google Dorks, SQLi and XSS, rudementary MITM, network scanners and port knocking, Android vulnerabilities, buffer overflows, Metasploit, password cracking, and popular tooling.<br><br> What follows is a list of these PoC's and their respective reports. Actual demo scripts can be provided upon request.</p>",
    "date": "January 2025 - May 2025",
    "thumbnail": "project-securitypocs/thumb-securitypocs.png",
    "reports": [
      {
        "label": "PoC Report - Finding OWASP Vulnerabilities w/ Google Dorks",
        "url": "/reports/poc_owasp10_dorking.pdf"
      },
      {
        "label": "PoC Report - Performing an Authentication Bypass",
        "url": "/reports/poc_authentication_bypass.pdf"
      },
      {
        "label": "PoC Report - Stored and Reflected XSS Injections",
        "url": "/reports/poc_xss.pdf"
      },
      {
        "label": "PoC Report - SQL Injections",
        "url": "/reports/poc_sqli.pdf"
      },
      {
        "label": "PoC Report - MITM Attacks",
        "url": "/reports/poc_mitm.pdf"
      },
      {
        "label": "PoC Report - Custom NMAP and Scanners",
        "url": "/reports/poc_customnmap.pdf"
      },
      {
        "label": "PoC Report - Port Knocking",
        "url": "/reports/poc_portknocking.pdf"
      },
      {
        "label": "PoC Report - Honeypots",
        "url": "/reports/poc_honeypots.pdf"
      },
      {
        "label": "PoC Report - APKs and Android Vulnerabilities",
        "url": "/reports/poc_apks.pdf"
      },
      {
        "label": "PoC Report - Buffer Overflows",
        "url": "/reports/poc_buffer_overflows.pdf"
      },
      {
        "label": "PoC Report - Ret2Lib and Rop Chains",
        "url": "/reports/poc_ret2lib.pdf"
      },
      {
        "label": "PoC Report - Shellcode",
        "url": "/reports/poc_shellcoding.pdf"
      },
      {
        "label": "PoC Report - Metasploit Basics",
        "url": "/reports/poc_metasploit.pdf"
      },
      {
        "label": "PoC Report - Password Cracking",
        "url": "/reports/poc_password_cracking.pdf"
      },
      {
        "label": "PoC Report - RNGs",
        "url": "/reports/poc_rngs.pdf"
      },
      {
        "label": "PoC Report - Static Analysis Tools",
        "url": "/reports/poc_static_analysis.pdf"
      },
      {
        "label": "PoC Report - Fuzzing",
        "url": "/reports/poc_fuzzing.pdf"
      },
      {
        "label": "PoC Report - Symbolic Execution",
        "url": "/reports/poc_symbolic_execution.pdf"
      },
      {
        "label": "PoC Report - Strace",
        "url": "/reports/poc_strace.pdf"
      },
      {
        "label": "PoC Report - Ltrace",
        "url": "/reports/poc_ltrace.pdf"
      },
      {
        "label": "PoC Report - Custom GDB",
        "url": "/reports/poc_gdb.pdf"
      },
      {
        "label": "PoC Report - Ptrace",
        "url": "/reports/poc_ptrace.pdf"
      },
      {
        "label": "PoC Report - Rootkits",
        "url": "/reports/poc_rootkits.pdf"
      },
      {
        "label": "Self Study - DirtyCow",
        "url": "/reports/selfstudy_dirtycow.pdf"
      },
      {
        "label": "Self Study - Eternal Blue",
        "url": "/reports/selfstudy_eternalblue.pdf"
      },
      {
        "label": "Self Study - GoToFail",
        "url": "/reports/selfstudy_gotofail.pdf"
      },
      {
        "label": "Self Study - Heartbleed",
        "url": "/reports/selfstudy_heartbleed.pdf"
      },
      {
        "label": "Self Study - Meltdown",
        "url": "/reports/selfstudy_meltdown.pdf"
      },
      {
        "label": "Self Study - PingOfDeath",
        "url": "/reports/selfstudy_pingofdeath.pdf"
      },
      {
        "label": "Self Study - ShellShock",
        "url": "/reports/selfstudy_shellshock.pdf"
      },
      {
        "label": "Self Study - Spectre",
        "url": "/reports/selfstudy_spectre.pdf"
      },
      {
        "label": "Self Study - WannaCry",
        "url": "/reports/selfstudy_wannacry.pdf"
      }
    ],
    "images": []
  },
  {
    "id": "project-pandapos",
    "title": "PandaPOS",
    "blurb": "I took CSCE 331, Foundations of Software Engineering, at Texas A&M. This class contained three projects, two of which were aimed towards making a fully functional POS system for Panda Express.",
    "description": "<p>Texas A&M offers CSE 331, Foundations of Software Engineering. While I was familiar with most of the technologies that we used within this class (Java, MySQL, Python, React), I had never worked in such a large team on such an elaborate project. The first project of the class was to make a personal website, and the remaining two projects were to make a functional POS for Panda Express in a team of 6.<br><br>The first PandaPOS project was directed using Waterfall. Our team, named RevFault, designed our MySQL database and made a desktop application with Java Swing. This application had two 'views'; Manager and Employee. The Manager view offered the ability to view store statistics, keep track of inventory, manage employees, and edit menu items. The Employee view offered the ability for any employee on a POS to input orders for customers.<br><br>The second POS Panda Express project was done via a webapp and offered three new views- a Menu, Kiosk, and Kitchen views, all somewhat self-explanatory. This project was directed via Scrum.<br><br>This class was really a trial by fire, but I learned a lot in the realm of teamwork and project management. The final web-based project ended with separate formal and technical presentations and demos.</p>",
    "date": "September 2024 - December 2024",
    "thumbnail": "project-pandapos/thumb_panda.png",
    "images": [
      "project-pandapos/pandapos-order.png",
      "project-pandapos/pandapos-manager.png",
      "project-pandapos/pandapos-menu.png",
      "project-pandapos/pandapos-dbuml.png",
      "project-pandapos/pandapos_gui.png"
    ]
  },
  {
    "id": "project-kavtools",
    "title": "KavTools",
    "blurb": "The art and self-help communities I associate myself with want tools to make learning and habit-tracking easier. Given that I needed more experience with web development, I decided to make tools for the communities that I associate myself with.",
    "description": "<p>KavTools is an ongoing project to make tools for the art communities that I am apart of and to gain more experience in web development. If I am able to craft tools that solve problems in art comprehension, then I am able to simultaneously solve those problems for myself and others.<br><br>The project originally began in Unity, but I later realized that it had to be done in JavaScript, or at least some other language more closely related to web development. I then found Three.js, a library for displaying 3D environments in-browser. While it was a pretty heavy learning curve, it was extremely fun to experiment with.<br><br>Here are some of the tools and games that I want to implement by the end of this year:</p><strong>Intersection Tool:</strong> A tool for visualizing intersections between primitive objects.<br><strong>Box Tool:</strong> A tool for manipulating the vanishing points of boxes, as well as having a step-by-step drawing mode.<br><strong>Pose Tool:</strong> Using machine vision, I will scan many poses of myself and others to store them in vector format. These can be then loaded on any model for pose referencing.<br><strong>Midpoint Game:</strong> A game where the user will be prompted to 'guess' the midpoint of an object. These objects could be lines or planes.<br><strong>Degree Game:</strong> A game where the user will be prompted to 'guess' the degree and axis of an ellipse.</p>",
    "date": "July 2024",
    "thumbnail": "project-kavtools/thumb_intersector.png",
    "images": [
      "project-kavtools/kav_control.png",
      "project-kavtools/kav_unity.png"
    ]
  },
  {
    "id": "project-rummikub",
    "title": "Rummikub Solver",
    "blurb": "My Dad beat me in a game of Rummikub, so I made an algorithm that finds the largest combination of pieces to play every turn.",
    "description": "<p>Our parents will always be better than us at many things, but I draw the line on a niche board game that most people have never heard of.<br><br>After recently finishing my Data Structures and Algorithms class, I had plenty of graph theory concepts floating around in my head. While too complex for what I am willing to write here, my heuristic solution to the game was to first create edges between all possible combinations of board tiles and then to systematically cull them (using a method much like Bellman-Ford) based on some abstract properties I defined, such as 'neediness.'<br><br>Most of this program was designed on server notepads and used to-go bags during my free time at my summer restaurant job. While I definitely carved my own path with solving this algorithm, some of the logic was inspired by 'The Complexity of Rummikub Problems' by Jan N. van Rijn et al.<br><br>The program was created using Python. The program accepts an input string of existing tiles (from both the board and your hand) and attempts to find the highest number of playable tiles while still considering tiles that have not been played yet.</p>",
    "date": "June 2024",
    "thumbnail": "project-rummikub/thumb_rummi.png",
    "images": [
      "project-rummikub/rummi_notes.png"
    ]
  },
  {
    "id": "project-hikikabu",
    "title": "Hiki Kabu",
    "blurb": "I discovered a niche Japanese card game called Hiki Kabu that I wanted to turn into an online Unity card game.",
    "description": "<p>I had the amazing opportunity to travel to Portugal during the winter of 2023. I was hopping from hostel to hostel, meeting wonderful people and learning of their stories. Stores are best shared around a game of cards, and one of these games originated from the Kabufuda card deck.<br><br>Hiki Kabu is one of many games played with the Kabufuda card deck. Simple and almost completely luck-based, I knew it was something I had to create to memorialize my experience in Portugal and my love for making games.<br><br>This project is sadly unfinished due to time constraints and the scope of the project. I want to return to this project one day with a simplified and clean approach, but only time will tell.</p>",
    "date": "January 2024",
    "thumbnail": "project-hikikabu/thumb_kabu.png",
    "images": [
      "project-hikikabu/kabu_screen.png",
      "project-hikikabu/kabu_flow.png"
    ]
  },
  {
    "id": "project-kaggle",
    "title": "Kaggle Competition",
    "blurb": "As part of the Aggie Data Science Club, my friend Matthew and I entered a Kaggle competition using the Microsoft Professional Capstone DataSet.",
    "description": "<p>As members of the introductory branch of the Aggie Data Science Club (A.D.S.C.), my friend Matthew Smith and I teamed up to contend in the Kaggle Data competition.<br><br>This in-house competition rewarded the team with the best regression and presentation of the selected data project. In this instance, it was the Microsoft Professional Capstone DataSet.<br><br>After much hard work, Matthew and I were able to win the competition with our regression and presentation. The concepts we learned from A.D.S.C. were invaluable towards our understanding of data science and team projects in general.</p>",
    "date": "November 2023",
    "thumbnail": "project-kaggle/thumb_kaggle.png",
    "images": [
      "project-kaggle/kaggle_correlation.png",
      "project-kaggle/kaggle_datatree.png"
    ]
  },
  {
    "id": "project-tolltext",
    "title": "Toll Text Translator",
    "blurb": "I was pretty interested in ciphers in high school, and still am today. Inspired by One Piece Poneglyphs, I decided to make a conlang and translator.",
    "description": "<p>I love when games or A.R.G.'s have unique and exciting puzzles that lead to rabbit holes. Inspired by the enigmatic Poneglyphs from One Piece, the conlang named 'Toll Text' was to be used in a now canceled final map for the game Garry's Mod.<br><br>While I still will maintain secrecy about the translation scheme of Toll Text, my goal in developing it was to completely rethink how consonants and syllables of a language are arranged visually. I plan on using the lessons learned from developing Toll Text in future projects surrounding my art and writing.</p>",
    "date": "July 2023",
    "thumbnail": "project-tolltext/thumb_tolltext.png",
    "images": [
      "project-tolltext/toll_notes.png",
      "project-tolltext/toll_screenshot.png"
    ]
  },
  {
    "id": "project-gamedev",
    "title": "Game Development",
    "blurb": "I grew up with videogames, so its only natural that I'd want to make a few. Here's a couple Source Engine maps, games, and Unity projects.",
    "description": "<p>When you grow up with video games, you'll end up wanting to make them. Ever since I began playing Garry's Mod, I've had lots of fun playing around with varying map-making concepts and gameplay features. Some of these games and maps include;<br>- A decades-old telecommunications bunker hosting the remenants of a past explorer's escape from society.<br>- A concrete jungle populated only by you, a set of puzzles, and an eerie breeze that seems to follow you wherever you go.<br>- A hommage to the classic Garry's Mod construct style with references to Demazure's work.<br>A movement puzzle shooter combining the best aspects of SUPERHOT and Quantum Break.<br>- A 2D rendition of Tom Clancy's Rainbow Six Siege.</p>",
    "date": "February 2018 - May 2023",
    "thumbnail": "project-gamedev/thumb_frame.png",
    "images": [
      "project-gamedev/gamedev_frame.png",
      "project-gamedev/gamedev_pile.png",
      "project-gamedev/gamedev_spicee.png",
      "project-gamedev/gamedev_garden.png"
    ]
  }
]
